Repository: SanderGi/eKichabi
Catalog: ekichabi-server/locale/*/LC_MESSAGES/django.po
Languages: sw

source: Swahili
sw: Kiswahili

source: English
sw: Kiingereza

source: Your query could not be found. Please check spelling and try again, or enter %s to go back.
sw: Swali lako halikupatikana. Tafadhari, hakikisha herufi na jaribu tena, au ingiza %s rudi nyuma.

source: Enter a business name, village, or category. Make sure your spelling is correct!
sw: Tafadhali ingiza jina la biashara, kiwanja, au kijiji. Hakikisha kama herufi zako ni sahihi.

source: Type the first part of a %(type)s:
sw: Andika sehemu ya kwanza ya %(type)s:

source: Too many results. Enter %s to go back, then enter a longer query
sw: Matokeo mengi sana. Ingiza %s rudi nyuma, kisha ingiza swali la muda mrefu.

source: Go Back
sw: Kurudi nyuma

source: Your input is not a valid menu item. Please try again.
sw: Chaguo lako uliloingiza sio sahihi, tafadhari jaribu tena.

source: What level do you want to search for
sw: Unataka kutafuta kiwango gani

source: District
sw: Wilaya

source: Village
sw: Kijiji

source: Subvillage
sw: Kitongoji

source: Do you want to filter results by location?
sw: Je, ungependa kuchuja matokeo kulingana na eneo?

source: Yes
sw: Ndiyo

source: No
sw: Hapana

source: What would you like to search for?
sw: Ni nini cha kutafuta?

source: Business
sw: Biashara

source: Location
sw: Mahali

source: Product/Service
sw: Bidhaa/Huduma

source: Product/Crop
sw: Bidhaa/Mazao

source: Sector/Service
sw: Sekta/Huduma

source: Crop
sw: Mazao

source: Sector
sw: Sekta

source: Owner name
sw: Jina la mmiliki

source: Select a village:
sw: Chagua kijiji:

source: More than one business with that name exists. Select the location of your business:
sw: Biashara zaidi ya moja kwenye jina linalojulikana. Chagua eneo la biashara yako.

source: %(name)s %(line)s %(keywords)s Owner: %(owner)s Located in: %(location)s Phone: %(number)s
sw: %(name)s %(line)s %(keywords)s Mmiliki: %(owner)s Wapi: %(location)s Simu: %(number)s

source: next, %s. back
sw: Mbele, %s. Rudi nyuma

source: Send SMS
sw: Tuma SMS

source: Done
sw: Imekamilika

source: All businesses have been visited in person to collect contact information, but please use discretion when transacting with unknown individuals
sw: Biashara zote zimetembelewa kibinafsi ili kukusanya habari za mawasiliano, lakini tafadhali tumia busara unaposhughulika na watu wasiojulikana

source: next
sw: Mbele

source: Enter %s to go back from any screen.
sw: Ingiza %s rudi nyuma kutoka skrini yoyote.

source: Select a %(filter)s:
sw: Chagua %(filter)s:

source: All businesses (%(num_biz)s), or
sw: Biashara Zote (%(num_biz)s), au

source: Select a Business:
sw: Chagua biashara:

source: %s. Back
sw: %s. Rudi nyuma

source: %s. back
sw: %s. Rudi nyuma

source: Welcome to eKichabi!
sw: Karibu eKichabi!

source: Welcome to eKichabi! Enter %s to go back from any screen.
sw: Karibu eKichabi! Ingiza %s rudi nyuma kutoka skrini yoyote.

source: Select an option:
sw: Chagua ya ziada:

source: Search by category
sw: Tafuta kwa kuchagua sekta

source: Browse by location
sw: Tafuta kwa kuchagua mahali

source: Search
sw: Tafuta kwa kuandika

source: Instructions
sw: Maelekezo

source: Databases Not Setup
sw: Hifadhidata Haijawekwa

source: Category
sw: Sekta

source: Subsector
sw: Sekta ndogo

source: Hiring and Labor
sw: Kukodi

source: Financial Services
sw: Fedha

source: Non-Agri Services
sw: Nyingine

source: Transport
sw: Usafirishaji

source: Agricultural processing
sw: Usindikaji

source: Merchant/retail
sw: Rejareja

source: Trading and wholesale
sw: Jumla

source: Repairs
sw: Fundi

source: Services
sw: Huduma

source: Skilled Trades
sw: Fundi/Ujuzi

source: Need help? Call %s.
sw: Unahitaji msaada? Piga simu %s.

source: Your query could not be found. Please check spelling and try again, enter %s to go back or press %s to end the session.
sw: Hoja yako haikupatikana. Tafadhali angalia tahajia na ujaribu tena, weka %s ili kurudi nyuma au bonyeza %s ili kumaliza kipindi.

source: Press %s to end the session.
sw: Bonyeza %s ili kumaliza kipindi.

source: There was more than 100 results. Do you want to filter 100 random results by location?
sw: Kulikuwa na matokeo zaidi ya 100. Je, unataka kuchuja matokeo 100 bila mpangilio kulingana na eneo?

source: Too many results (%i). Enter %s to go back or enter a longer query
sw: Matokeo mengi sana (%i). Weka %s ili kurudi nyuma au uweke hoja ndefu zaidi

source: Your query could not be found. Please check spelling and try again. Enter %s to go back or enter a longer query
sw: Hoja yako haikupatikana. Tafadhali angalia tahajia na ujaribu tena. Weka %s ili kurudi nyuma au uweke hoja ndefu zaidi

source: You have reached the eKichabi service. We are only sharing it with a few phone numbers currently, please check back in a couple months!
sw: Umefikia huduma ya eKichabi. Tunahusisha namba chache za simu kwasasa, tafadhali angalia tena baada ya miezi michache.

source: Business name
sw: Jina la biashara

source: Enter %s to go back from any screen. Enter %s to go back to the home screen from any screen.
sw: Ingiza %s ili kurudi nyuma kutoka skrini yoyote. Weka %s ili kurudi kwenye skrini ya kwanza kutoka skrini yoyote.

source: No businesses were found matching your search. Enter a new search, or press %s to go back.
sw: Hakuna biashara zilizopatikana kulingana na utafutaji wako. Ingiza utafutaji mpya, au bonyeza %s ili kurudi nyuma.

source: Specialty
sw: Umaalumu

source: Agricultural Product
sw: Bidhaa za Kilimo

source: Livestock
sw: Mifugo

source: Others
sw: Wengine
